
#ifndef SONICTEAM__PLAYER__IEVENTERSHAREDWORK
#define SONICTEAM__PLAYER__IEVENTERSHAREDWORK

#include "Defs.h"


namespace Sonicteam{
	namespace Player{


		//82220C7C
		//seems class recieve flags then using it later ?? Gauge / shoes more oither
		class IEventerSharedWork
		{
		public:
			IEventerSharedWork(void);
			~IEventerSharedWork(void);

			unsigned int Flags0x0; //0x0
			unsigned int Flags0x4; //0x0
			unsigned int Flags0x8; //0x0
			unsigned int Flags0xC; //0x0
			unsigned int Flags0x10; //0x0
			unsigned int Flags0x14; //0x0
			unsigned int Flags0x18; //0x0
			unsigned int Flags0x1C; //0x0
			unsigned int Flags0x20; //0x0
			unsigned int Flags0x24; //0x0
			unsigned int Flags0x28; //0x0
			unsigned int Flags0x2C; //0x0
			unsigned int Flags0x30; //0x0
			unsigned int Flags0x34; //0x0
			unsigned int Flags0x38; //0x0
			unsigned int Flags0x3C; //0x0
			unsigned int Flags0x40; //0x0
			unsigned int Flags0x44; //0x0
			unsigned int Flags0x48; //0x0
			unsigned int Flags0x4C; //0x0
			unsigned int Flags0x50; //0x0
			unsigned int Flags0x54; //0x0
			unsigned int Flags0x58; //0x0
			


		};
	}
}




#endif

