#pragma once

#ifndef SONICTEAM__PLAYER__SCORE
#define SONICTEAM__PLAYER__SCORE


#include "Defs.h"
#include "IPlugIn.h"
#include "IVariable.h"
#include "IStepable.h"
#include "IScore.h"
#include <xtl.h> //replace to xbox math soon

#include <Player/ObjectPlayer.h>

namespace Sonicteam
{
	namespace Player
	{
		class Score:IScore
		{
		public:
			Score(int*,int*,int,int*);
			~Score(void);






			///Fields

			uint32_t RingsCount; //0x28
			uint32_t ScoreCount; //0x2C ????? (Rings PR Count)

			int PtrRootFrame; //0x30
			Sonicteam::Player::ObjectPlayer* PtrObjectPlayer; //0x34

			int unk0x38; // 0x38
			int unk0x3C; // 0x3C

			XMFLOAT4 unkvector; //0x40

			int PtrGameImpulse; //0x50
			int PtrPackageBinary; //0x54

			int unkfield0x58;
			int unkfield0x5C;
			int unkfield0x60;

			int unkfield0x64;
			int unkfield0x68;
			int unkfield0x6C;




			///vfttable
			virtual void AddRings(uint32_t);
			virtual void TakeDamage(void);
			virtual void TakeDamageLittle();
			virtual uint32_t GetRings();
			virtual void SetRings(uint32_t);
			virtual void SetUnknownVector(XMFLOAT4*); //or just XMFLOAT4


			virtual void OnVarible(void);
			virtual void OnStepable(float);

		};

	}
}



#endif
